In [1]:
import pandas as pd
import numpy as np

In [2]:
import pandas as pd
import numpy as np

pd.set_option("display.max_columns", None)

In [3]:
df = pd.read_csv("data/dataset.csv")
df.head()

,customer_id,order_date,product_id,category_id,category_name,product_name,quantity,price,payment_method,city,review_score,gender,age
0,13542,17-12-2024,784,10,Electronics,Smartphone,2,373.36,Credit Card,New Oliviaberg,1.0,F,56
1,23188,01-06-2024,682,50,Sports & Outdoors,Soccer Ball,5,299.34,Credit Card,Port Matthew,NaN,M,59
2,55098,04-02-2025,684,50,Sports & Outdoors,Tent,5,23.00,Credit Card,West Sarah,5.0,F,64
3,65208,28-10-2024,204,40,Books & Stationery,Story Book,2,230.11,Bank Transfer,Hernandezburgh,5.0,M,34
4,63872,10-05-2024,202,20,Fashion,Skirt,4,176.72,Credit Card,Jenkinshaven,1.0,F,33

In [4]:

df.shape

(1000, 13)

**The dataset contains 1,000 records and 13 features related to customer purchases, 
including customer demographics, product details, pricing, and transaction metadata.**

In [5]:
df.columns

Index(['customer_id', 'order_date', 'product_id', 'category_id',
       'category_name', 'product_name', 'quantity', 'price', 'payment_method',
       'city', 'review_score', 'gender', 'age'],
      dtype='object')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     1000 non-null   int64
 1   order_date      1000 non-null   object
 2   product_id      1000 non-null   int64
 3   category_id     1000 non-null   int64
 4   category_name   1000 non-null   object
 5   product_name    1000 non-null   object
 6   quantity        1000 non-null   int64
 7   price           1000 non-null   float64
 8   payment_method  1000 non-null   object
 9   city            1000 non-null   object
 10  review_score    799 non-null    float64
 11  gender          897 non-null    object
 12  age             1000 non-null   int64
dtypes: float64(2), int64(5), object(6)
memory usage: 101.7+ KB

In [7]:
df.describe()

,customer_id,product_id,category_id,quantity,price,review_score,age
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,799.000000,1000.000000
mean,55490.723000,540.726000,30.030000,2.947000,251.850660,3.992491,46.382000
std,25910.185857,261.737704,14.370303,1.413573,139.194688,1.239469,16.569992
min,10201.000000,100.000000,10.000000,1.000000,10.720000,1.000000,18.000000
25%,33857.000000,311.750000,20.000000,2.000000,128.525000,3.000000,32.000000
50%,54619.500000,542.500000,30.000000,3.000000,250.220000,4.000000,47.000000
75%,77848.500000,770.750000,40.000000,4.000000,366.467500,5.000000,61.000000
max,99923.000000,995.000000,50.000000,5.000000,499.500000,5.000000,75.000000

In [8]:
# Observed some cancelled transactions with negative quantity
df.sample(5)

,customer_id,order_date,product_id,category_id,category_name,product_name,quantity,price,payment_method,city,review_score,gender,age
544,94597,28-12-2024,241,10,Electronics,Headphones,2,302.59,Credit Card,Griffintown,5.0,F,28
488,89887,13-05-2024,576,30,Home & Living,Blanket,3,197.53,Credit Card,West Stevenburgh,5.0,F,32
365,35219,03-01-2025,739,40,Books & Stationery,Notebook,4,410.06,Cash on Delivery,East Lucas,1.0,M,21
925,68218,11-06-2024,680,50,Sports & Outdoors,Basketball,4,237.15,Cash on Delivery,Markton,4.0,F,39
408,61329,07-12-2024,311,10,Electronics,Laptop,2,50.52,Bank Transfer,Ashleychester,5.0,M,74

**The dataset contains 1,000 purchase records with information about customers, products, and transactions.
Most columns are complete, but review_score and gender have missing values.
The order_date column is currently stored as an object and will need conversion to datetime for time-based analysis.
The dataset appears suitable for analyzing customer behavior, product performance, and sales trends.**

## 2. Data Cleaning

In [9]:
df['order_date'] = pd.to_datetime(df['order_date'], format = "%d-%m-%Y")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     1000 non-null   int64
 1   order_date      1000 non-null   datetime64[ns]
 2   product_id      1000 non-null   int64
 3   category_id     1000 non-null   int64
 4   category_name   1000 non-null   object
 5   product_name    1000 non-null   object
 6   quantity        1000 non-null   int64
 7   price           1000 non-null   float64
 8   payment_method  1000 non-null   object
 9   city            1000 non-null   object
 10  review_score    799 non-null    float64
 11  gender          897 non-null    object
 12  age             1000 non-null   int64
dtypes: datetime64[ns](1), float64(2), int64(5), object(5)
memory usage: 101.7+ KB

In [10]:
df['order_date'].head()

0   2024-12-17
1   2024-06-01
2   2025-02-04
3   2024-10-28
4   2024-05-10
Name: order_date, dtype: datetime64[ns]

**Converted order_date to datetime using explicit day-first format**

In [11]:
df['review_score']=df['review_score'].fillna(df['review_score'].median())

In [12]:
df.isnull().sum()

customer_id         0
order_date          0
product_id          0
category_id         0
category_name       0
product_name        0
quantity            0
price               0
payment_method      0
city                0
review_score        0
gender            103
age                 0
dtype: int64

In [13]:
df['gender']=df['gender'].fillna("Unknown")

In [14]:
df.isnull().sum()

customer_id       0
order_date        0
product_id        0
category_id       0
category_name     0
product_name      0
quantity          0
price             0
payment_method    0
city              0
review_score      0
gender            0
age               0
dtype: int64

In [15]:
df.duplicated().sum()

0

In [16]:
df[['quantity', 'price', 'age', 'review_score']].describe()

          quantity        price          age  review_score
count  1000.000000  1000.000000  1000.000000   1000.000000
mean      2.947000   251.850660    46.382000      3.994000
std       1.413573   139.194688    16.569992      1.107787
min       1.000000    10.720000    18.000000      1.000000
25%       2.000000   128.525000    32.000000      4.000000
50%       3.000000   250.220000    47.000000      4.000000
75%       4.000000   366.467500    61.000000      5.000000
max       5.000000   499.500000    75.000000      5.000000

## Numerical Data Validation

- The numerical columns (quantity, price, age, and review_score) were validated using descriptive statistics.
- No negative or unrealistic values were observed.
- Quantities and prices fall within reasonable ranges for retail transactions, and customer ages are within an expected adult range.
- The dataset appears suitable for further exploratory analysis.

## Dataset cleaned:
- Converted order_date to datetime
- Filled missing review_score with median
- Filled missing gender with 'Unknown'
- No duplicates found

## 3. Exploratory Data Analysis

In [17]:
df['revenue']=df['quantity']*df['price']
df[['quantity', 'price', 'revenue']].head()
total_revenue= df['revenue'].sum()
total_revenue

737326.8800000001

**Insight:** 
The total revenue generated across all transactions in the dataset is approximately ₹737326.8  
This represents the overall sales volume captured in the data and provides a baseline for further analysis.

In [19]:
avg_order_value = df['revenue'].mean()
avg_order_value

737.3268800000001

**Insight:**  
The average order value (AOV) is approximately ₹737.33, indicating that customers spend around this amount per transaction on average.  
This metric helps assess customer purchasing behavior and can be used to evaluate the impact of pricing or promotional strategies.

In [22]:
category_revenue = ( df.groupby('category_name')['revenue'].sum()
                    .sort_values(ascending = False))
category_revenue

category_name
Electronics           166510.34
Sports & Outdoors     154346.26
Books & Stationery    143215.52
Home & Living         138540.15
Fashion               134714.61
Name: revenue, dtype: float64

**Insight:**  
The Electronics category generates the highest total revenue (₹166,510), indicating strong customer demand for electronic products.  
However, revenue across other categories is relatively evenly distributed, with no category showing a significantly lower contribution.  
This suggests that while Electronics leads in revenue, overall business performance is supported by a balanced demand across all product categories.

In [26]:
product_quantity = (
    df.groupby('product_name')['quantity']
      .sum()
      .sort_values(ascending=False)
)



product_revenue = (
    df.groupby('product_name')['revenue']
      .sum()
      .sort_values(ascending=False)
)

(product_revenue.head(10), product_quantity.head(10))

(product_name
 Smartphone     38319.26
 Notebook       38027.68
 Yoga Mat       37752.08
 Soccer Ball    37587.30
 Tablet         33581.02
 Vase           32191.58
 Laptop         32000.38
 Smartwatch     31820.10
 Headphones     30789.58
 T-shirt        30718.54
 Name: revenue, dtype: float64,
 product_name
 Smartphone       159
 Yoga Mat         149
 Soccer Ball      137
 T-shirt          135
 Laptop           134
 Eraser           131
 Notebook         131
 Running Shoes    131
 Vase             128
 Headphones       128
 Name: quantity, dtype: int64)

**Insight:**  
The Smartphone product ranks highest in both total quantity sold and total revenue, indicating strong demand combined with a relatively higher price point.  
However, the comparison shows that high sales volume does not always translate to high revenue, as some products (e.g., Eraser, Running Shoes) sell in large quantities but generate lower overall revenue.  
Conversely, certain products achieve high revenue with fewer units sold, suggesting premium pricing.  
This highlights the importance of distinguishing between high-volume products and high-value products when designing pricing and promotional strategies.